import 'package:flutter/material.dart';

class Mujib extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    double screenHeight = MediaQuery.of(context).size.height;
    double screenWidth = MediaQuery.of(context).size.width;
    return MaterialApp(
      debugShowCheckedModeBanner: false,
      home: Scaffold(
          body: SafeArea(
        child: SingleChildScrollView(
          child: Column(
            children: [
              SizedBox(
                height: 15,
              ),
              Container(
                child: Row(
                  crossAxisAlignment: CrossAxisAlignment.center,
                  mainAxisAlignment: MainAxisAlignment.center,
                  children: [
                    buildGestureDetector(
                      context: context, // Pass the context here
                      title: 'বঙ্গবন্ধু ও বাংলাদেশ',
                      imagePath: 'assets/mujbbro.jpg',
                      screenWidth: screenWidth,
                      screenHeight: screenHeight,
                      receivedValue: 'mhistory',
                    ),
                    SizedBox(
                      width: screenWidth * .04,
                    ),
                    buildGestureDetector(
                      context: context, // Pass the context here
                      title: 'মূরাল হৃদয়ে বঙ্গবন্ধু',
                      imagePath: 'assets/mujibvro.jpg',
                      screenWidth: screenWidth,
                      screenHeight: screenHeight,
                      receivedValue: 'history',
                    ),
                  ],
                ),
              ),
            ],
          ),
        ),
      )),
    );
  }

  GestureDetector buildGestureDetector({
    required BuildContext context, // Pass BuildContext as a parameter
    required String title,
    required String imagePath,
    required double screenWidth,
    required double screenHeight,
    required String receivedValue,
  }) {
    return GestureDetector(
      onTap: () {
        if (receivedValue == 'mhistory') {
          Navigator.push(
            context,
            MaterialPageRoute(
              builder: (context) => mujibur(),
            ),
          );
        } else if (receivedValue == 'history') {
          Navigator.push(
            context,
            MaterialPageRoute(
              builder: (context) => mujibur1(),
            ),
          );
        } else {}
      },
      child: Container(
        height: screenHeight * 0.20,
        width: screenWidth * 0.45,
        decoration: BoxDecoration(
          borderRadius: BorderRadius.circular(7),
          color: Color.fromARGB(255, 255, 255, 255),
          boxShadow: [
            BoxShadow(
              color: Colors.black.withOpacity(0.1),
              spreadRadius: 2,
              blurRadius: 3,
              offset: Offset(0, 3),
            ),
          ],
        ),
        child: Column(
          children: [
            Image.asset(
              imagePath,
              width: 60,
              height: 50,
              fit: BoxFit.cover,
            ),
            Padding(
              padding: EdgeInsets.only(top: 9.0),
              child: Text(
                title,
                style: TextStyle(),
              ),
            ),
          ],
          mainAxisAlignment: MainAxisAlignment.center,
        ),
        alignment: Alignment.center,
      ),
    );
  }
}

class mujibur extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    double screenHeight = MediaQuery.of(context).size.height;

    return MaterialApp(
      debugShowCheckedModeBanner: false,
      home: Scaffold(
          body: SingleChildScrollView(
        child: SafeArea(
          child: Container(
            alignment: Alignment.center,
            child: Padding(
              padding: const EdgeInsets.all(8.0),
              child: Container(
                decoration: BoxDecoration(
                    border: Border.all(),
                    borderRadius: BorderRadius.circular(20)),
                child: Column(
                  mainAxisAlignment: MainAxisAlignment.center,
                  crossAxisAlignment: CrossAxisAlignment.center,
                  children: [
                    Container(
                      alignment: Alignment.center,
                      child: Center(child: Image.asset('assets/mujbbro.jpg')),
                      height: screenHeight * 0.19,
                      width: screenHeight * 0.3,
                    ),
                    SizedBox(
                      height: screenHeight * 0.019,
                    ),
                    SingleChildScrollView(
                      child: Padding(
                        padding: const EdgeInsets.all(8.0),
                        child: Text(
                          '''১৫ আগস্ট বাঙ্গালি জাতির শোক দিবস। এই দিনটিতে কতিপয় বিপথগামী সেনা সদস্যের হাতে নির্মমভাবে সপরিবারে নিহত হন বাঙ্গালি জাতির জনক বঙ্গবন্ধু শেখ মুজিবুর রহমান। বঙ্গবন্ধু শেখ মুজিবুর রহমানের জীবন ইতিহাস মানে স্বাধীন বাংলাদেশের ইতিহাস। তার জীবন ইতিহাসের সাথে বাংলাদেশের ইতিহাস জড়িত। এই মহান মানুষটি জীবনে যাই করেছেন তার সবই দেশের জন্য করেছেন। তার প্রত্যেকটা পদক্ষেপ ছিল দেশের সার্থে। তার জন্ম না হলে আজ আমরা স্বাধীনতা পেতাম না।

১৯২০ জাতির জনক বঙ্গবন্ধু শেখ মুজিবুর রহমান ফরিদপুর জেলার গোপালগঞ্জ মহকুমার (বর্তমানে জেলা) টুঙ্গিপাড়া গ্রামে এক সম্ভ্রান্ত মুসলিম পরিবারে ১৯২০ সালের ১৭ মার্চ জন্মগ্রহণ করেন। শেখ লুৎফর রহমান ও মোসাম্মৎ সাহারা খাতুনের চার কন্যা ও দুই পুত্রের মধ্যে তৃতীয় সন্তান শেখ মুজিব। বাবা-মা তাকে খোকা বলে ডাকতেন। খোকার শৈশবকাল কাটে টুঙ্গিপাড়ায়। ১৯২৭ সালে ৭ বছর বয়সে গিমাডাঙ্গা প্রাইমারি স্কুলে পড়াশোনা শুরু করেন। নয় বছর বয়সে গোপালগঞ্জ পাবলিক স্কুলে তৃতীয় শ্রেণীতে ভর্তি হন। পরে তিনি স্থানীয় মিশনারী স্কুলে ভর্তি হন। ১৯৩৪ সালে ১৪ বছর বয়সে বেরিবেরি রোগে আক্রান্ত হলে তার একটি চোখ কলকাতায় অপারেশন করা হয় এবং চক্ষুরোগের কারণে তার লেখাপড়ার সাময়িক বিরতি ঘটে। ১৯৩৭ সালে চক্ষুরোগে চার বছর শিক্ষাজীবন ব্যাহত হওয়ার পর শেখ মুজিব পুনরায় স্কুলে ভর্তি হন। ১৯৩৮সালে ১৮ বছর বয়সে বঙ্গবন্ধু ও বেগম ফজিলাতুননেছার আনুষ্ঠানিক বিয়ে সম্পন্ন হয়। তারা দুই কন্যা শেখ হাসিনা, শেখ রেহানা ও তিন পুত্র শেখ কামাল, শেখ জামাল ও শেখ রাসেলের জনক-জননী।''',
                          style: TextStyle(fontSize: 20),
                          textAlign: TextAlign.center,
                        ),
                      ),
                    )
                  ],
                ),
              ),
            ),
          ),
        ),
      )),
    );
  }
}

class mujibur1 extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    double screenHeight = MediaQuery.of(context).size.height;

    return MaterialApp(
      debugShowCheckedModeBanner: false,
      home: Scaffold(
          body: SingleChildScrollView(
        child: SafeArea(
          child: Container(
            alignment: Alignment.center,
            child: Padding(
              padding: const EdgeInsets.all(8.0),
              child: Container(
                decoration: BoxDecoration(
                    border: Border.all(),
                    borderRadius: BorderRadius.circular(20)),
                child: Column(
                  mainAxisAlignment: MainAxisAlignment.center,
                  crossAxisAlignment: CrossAxisAlignment.center,
                  children: [
                    Container(
                      alignment: Alignment.center,
                      child: Center(child: Image.asset('assets/mural.jpeg')),
                      height: screenHeight * 0.19,
                      width: screenHeight * 0.3,
                    ),
                    SizedBox(
                      height: screenHeight * 0.019,
                    ),
                    SingleChildScrollView(
                      child: Padding(
                        padding: const EdgeInsets.all(8.0),
                        child: Text(
                          '''বঙ্গবন্ধু শেখ মুজিবুর রহমানের জীবনী

 

১৭ই মার্চ, ১৯২০ সালে গোপালগঞ্জের টুঙ্গিপাড়ায় শেখ লুৎফুর রহমান এবং সায়রা বেগমের ঘরে জন্ম নেন জাতির জনক বঙ্গবন্ধু শেখ মুজিবুর রহমান। ছয় ভাইবোনের মধ্যে তিনি ছিলেন তৃতীয়। গোপালগঞ্জ পাবলিক স্কুল ও কলকাতা ইসলামিয়া কলেজে পড়াশনা শেষে ঢাকা বিশ্ববিদ্যালয় থেকে স্নাতক পাশ করেন। ১৮ বছর বয়সে বেগম ফজিলাতুন্নেসার সাথে তাঁর বিয়ে হয়। তাদের ২ মেয়ে - শেখ হাসিনা ও শেখ রেহানা এবং তিন ছেলে- শেখ কামাল, শেখ জামাল ও শেখ রাসেল।

 

অল্পবয়স থেকেই তাঁর রাজনৈতিক প্রতিভার প্রকাশ ঘটতে থাকে। ১৯৪০ সালে তিনি নিখিল ভারত মুসলিম লীগের ছাত্র সংগঠন নিখিল ভারত মুসলিম ছাত্র ফেডারেশনে যোগ দেন। কট্টরপন্থী এই সংগঠন ছেড়ে ১৯৪৩ সালে যোগ দেন উদারপন্থী ও প্রগতিশীল সংগঠন বেঙ্গল মুসলিম লীগে। এখানেই সান্নিধ্যে আসেন হুসেইন শহীদ সোহরাওয়ার্দীর। ঢাকা বিশ্ববিদ্যালয়ে থাকাকালীন সময়ে রক্ষণশীল কট্টরপন্থী নিখিল ভারত মুসলিম ছাত্র ফেডারেশনের কর্তৃত্ব খর্ব করতে তিনি প্রতিষ্ঠা করেন পূর্ব পাকিস্তান মুসলিম ছাত্র লীগ।

 

ভাষা আন্দোলনের সময় রাজনৈতিক নেতা হিসেবে অত্যন্ত গুরুত্বপূর্ণ ভূমিকা পালন করেন শেখ মুজিব। ১৯৪৮ সালে ভাষার প্রশ্নে তাঁর নেতৃত্বেই প্রথম প্রতিবাদ এবং ছাত্র ধর্মঘট শুরু হয় যা চূড়ান্ত রূপ নেয় ১৯৫২ সালের ২১ ফেব্রুয়ারিতে। 

 

পঞ্চাশের দশক তাঁর রাজনৈতিক উত্থানের কাল। ধীরে ধীরে তিনি হয়ে উঠেন দূরদর্শীতা এবং প্রজ্ঞাসম্পন্ন এক কুশলী রাজনৈতিক নেতা। এসময় শেখ মুজিব মুসলিম লীগ ছেড়ে দেন এবং হোসেন সোহরাওয়ার্দী এবং মাওলানা ভাসানীর সাথে মিলে গঠন করেন আওয়ামী মুসলিম লীগ। তিনি দলের প্রথম যুগ্ম সাধারণ সম্পাদক নির্বাচিত হন। ১৯৫৩ সালে তিনি দলের সাধারণ সম্পাদকের দায়িত্ব পান। ১৯৫৪ সালের সাধারণ নির্বাচনে জয়ী হয়ে যুক্তফ্রন্ট সরকারের কৃষি মন্ত্রী হন মুজিব। ১৯৫৬ সালে কোয়ালিশন সরকারের মন্ত্রিসভায় শিল্প ও বাণিজ্য মন্ত্রণালয়ের দায়িত্ব পান তিনি।
 

১৯৬৩ সালে হোসেন সোহরাওয়ার্দীর মৃত্যুর পর আওয়ামী মুসলিম লীগের সভাপতি নির্বাচিত হন শেখ মুজিব। তিনি ছিলেন আইয়ুব খানের ‌মৌলিক গণতন্ত্র তত্ত্বের কট্টর সমালোচক। ১৯৬৬ সালে লাহোরে অনুষ্ঠিত বিরোধী দলগুলোর জাতীয় সম্মেলনে শেখ মুজিবুর রহমান ঐতিহাসিক ৬ দফা দাবি উত্থাপন করেন। এই ছয় দফা ছিল পূর্ব পাকিস্তানের স্বায়ত্ত্বশাসনের রূপরেখা।
মুজিবের ৬ দফার প্রতি জনগণের ব্যাপক সমর্থনে ভীত হয়ে তৎকালীন পাকিস্তানি শাসকগোষ্ঠী আগরতলা ষড়যন্ত্র মামলায় গ্রেপ্তার শেখ মুজিবকে। এতে ক্ষুব্ধ হয়ে ওঠে বাংলার সমস্ত জনগণ। জনরোষের কাছে নতি স্বীকার করে এক পর্যায়ে তাঁকে মুক্তি দিতে বাধ্য হয় শোষকগোষ্ঠী। ১৯৬৯ সালের ২৩ ফেব্রুয়ারি ঢাকার রেসকোর্স ময়দানে কেন্দ্রীয় ছাত্র সংগ্রাম পরিষদের উদ্যোগে শেখ মুজিবুর রহমানকে গণসম্বর্ধনা দেওয়া হয়৷সেখানেই উত্থাপিত হয় এগার দফা দাবি যার মধ্যে ছয় দফার সবগুলোই দফাই অন্তর্ভুক্ত ছিল। লাখো মানুষের এই জমায়েতে শেখ মুজিবুর রহমানকে ‘বঙ্গবন্ধু’ উপাধিতে ভূষিত করা হয়৷

১৯৬৯ সালের ৫ ডিসেম্বর আয়োজিত এক জনসভায় বঙ্গবন্ধু শেখ মুজিব পূর্ব বাংলার নামকরণ করেন ‘বাংলাদেশ’। তিনি বলেন, “একসময় এদেশের বুক হইতে, মানচিত্রের পৃষ্ঠা হইতে ‘বাংলা’ কথাটির সর্বশেষ চিহ্নটুকুও চিরতরে মুছিয়া ফেলার চেষ্টা করা হইয়াছে। ... একমাত্র ‘বঙ্গোপসাগর’ ছাড়া আর কোন কিছুর নামের সঙ্গে ‘বাংলা’ কথাটির অস্তিত্ব খুঁজিয়া পাওয়া যায় নাই। ... জনগণের পক্ষ হইতে আমি ঘোষণা করিতেছি- আজ হইতে পাকিস্তানের পূর্বাঞ্চলীয় প্রদেশটির নাম পূর্ব পাকিস্তানের পরিবর্তে শুধুমাত্র বাংলাদেশ”।

১৯৭০ সালের ৭ ডিসেম্বরে সাধারণ নির্বাচনে শেখ মুজিবের নেতৃত্বে আওয়ামী লীগ প্রাদেশিক আইনসভায় নিরঙ্কুশ সংখ্যাগরিষ্ঠতা অর্জন করে। আওয়ামী লীগ তৎকালীন পূর্ব পাকিস্তানে জাতীয় পরিষদের ১৬৯টি আসনের মধ্যে ১৬৭টি আসন এবং প্রাদেশিক পরিষদের ৩১০টি আসনের মধ্যে ৩০৫টি আসন লাভ করে। কিন্তু পশ্চিম পাকিস্তানি শাসকগোষ্ঠী মুজিবের স্বায়ত্বশাসনের নীতির পুরোপুরি বিপক্ষে ছিলো। আওয়ামী লীগের সরকার গঠন ঠেকাতে প্রেসিডেন্ট ইয়াহিয়া খান সংসদের অধিবেশন ডাকা নিয়ে টালবাহানা শুরু করেন। শেখ মুজিব তখনই বুঝে যান যে, পশ্চিম পাকিস্তানি শাসকদের দুঃশাসনের অবসান ঘটাতে লড়াইয়ের কোনো বিকল্প নেই।

 

 

১৯৭১ সালের ৭ই মার্চ রেসকোর্স ময়দানে এক ঐতিহাসিক ভাষণে বঙ্গবন্ধু শেখ মুজিবুর রহমান স্বাধীনতার ডাক দেন। রেসকোর্সের জনসমুদ্রে বঙ্গবন্ধু ঘোষণা করেন “এবারের সংগ্রাম আমাদের মুক্তির সংগ্রাম, এবারের সংগ্রাম স্বাধীনতার সংগ্রাম”। ঐতিহাসিক এ ভাষণে জাতির জনক বঙ্গবন্ধু বাঙালি জাতিকে শৃংখল মুক্তির আহ্বান জানিয়ে ঘোষণা করেন, “রক্ত যখন দিয়েছি, রক্ত আরো দেবো। এদেশের মানুষকে মুক্ত করে ছাড়বো ইনশাল্লাহ্। ... প্রত্যেকে ঘরে ঘরে দূর্গ গড়ে তোলো। যার যা কিছু আছে তাই নিয়েই শত্রুর মোকাবিলা করতে হবে”।
বঙ্গবন্ধুর ডাকে উত্তাল হয়ে ওঠে সারা বাংলা। মুজিবের নেতৃত্বে বাঙ্গালি জাতির এই জাগরণে ভীত ইয়াহিয়া খান সামরিক আইন জারি করেন, নিষিদ্ধ করেন আওয়ামী লীগকে এবং শেখ মুজিবকে গ্রেপ্তারের নির্দেশ দেন।

 

এরপর আসে ২৫ মার্চ, ১৯৭১। রাতের অন্ধকারে নিরীহ নিরস্ত্র বাঙালীর ওপর শকুনের মতো ঝাঁপিয়ে পড়ে পাকিস্তানি সেনারা; শুরু করে অপারেশন সার্চলাইট নামে ইতিহাসের জঘন্যতম হত্যাকান্ড।অশীতিপর বৃদ্ধ থেকে কোলের শিশু- কেউ রক্ষা পায়না পাক হায়েনাদের নারকীয়তা থেকে। মুজিবকে গ্রেপ্তার করে নিয়ে যাওয়া হয় পশ্চিম পাকিস্তানে। অবশ্য তার আগেই, পাক বাহিনীর অভিযান শুরু হলে ২৬ মার্চ প্রথম প্রহরে শেখ মুজিবুর রহমান বাংলাদেশের স্বাধীনতার ঘোষণা দেন এবং জনগণকে সর্বাত্মক আন্দোলনে সামিল হতে আহ্বান জানান।

১৯৭১ সালের ১৭ই এপ্রিল গণপ্রজাতন্ত্রী বাংলাদেশের প্রথম সরকার গঠিত হয় এবং শেখ মুজিবকে রাষ্ট্রপতি করা হয়। তাঁর অনুপস্থিতিতে অস্থায়ী রাষ্ট্রপতির দায়িত্ব পালন করেন সৈয়দ নজরুল ইসলাম। এ সরকারের অধীনেই গঠিত হয় মুক্তিবাহিনী এবং শুরু হয় পাক সেনাদের প্রতিহত করার পালা। দীর্ঘ নয় মাসের রক্তক্ষয়ী লড়াইয়ের পর, ৩০ লক্ষ বাঙ্গালীর প্রাণের বিনিময়ে অবশেষে আসে বিজয়। ১৬ ডিসেম্বর সেই সোহরাওয়ার্দী উদ্যান যেখান থেকে স্বাধীনতা সংগ্রামের ডাক দিয়েছিলেন বঙ্গবন্ধু, সেখানেই বাংলাদেশ-ভারত মিত্রবাহিনীর কাছে আত্মসমর্পন করে পাকিস্তানী সেনাবাহিনী। পৃথিবীর মানচিত্রে জন্ম নেয় বাংলাদেশ নামের নতুন একটি দেশ।

 

১৯৭২ সালের ১০ জানুয়ারি বঙ্গবন্ধু ফিরে আসেন তাঁর প্রিয় মাতৃভূমিতে, তাঁর স্বপ্নের স্বাধীন দেশে। স্বাধীনতার স্বপ্নদ্রষ্টা, জাতির জনককে বরণ করতে লাখো মানুষের ঢল নামে বিমানবন্দরে। দেশে ফিরেই যুদ্ধ বিধ্বস্ত দেশ পুনর্গঠনে ঝাঁপিয়ে পড়েন বঙ্গবন্ধু । মানবিক বিপর্যয় মোকাবিলায় আন্তর্জাতিক সাহায্যের আবেদন জানান বঙ্গবন্ধু এবং খুব অল্প সময়ের মধ্যেই সাহায্য আসতে শুরু করে। শুরু হয় বাংলাদেশ পুনর্গঠনের এক নতুন যুদ্ধ। এরই মধ্যে সক্রিয় হয়ে ওঠে স্বাধীনতাবিরোধী একটি চক্র। মুক্তিযুদ্ধের বিরোধীতাকারী দেশীয় ও আন্তর্জাতিক চক্রের প্রত্যক্ষ ইন্ধনে রাজনৈতিক অস্থিতশীলতা সৃষ্টি করতে উঠেপড়ে লাগে এই চক্রটি। এসময় বঙ্গবন্ধু বুঝতে পারেন, রাজনৈতিক স্থিতিশীলতা ছাড়া দেশের উন্নয়ন সম্ভব নয়। ১৯৭৪ সালে তিনি সকল রাজনৈতিক দলকে এক ছাতার নীচে আনতে প্রতিষ্ঠা করেন বাংলাদেশ কৃষক শ্রমিক আওয়ামী লীগ বা ‘বাকশাল'। একই সাথে অন্যান্য সকল রাজনৈতিক দলকে নিষিদ্ধ করা হয়। উল্লেখ্য, প্রথম যে দলটি নিষিদ্ধ করা হয় তার নাম বাংলাদেষ আওয়াশী লীগ, শেখ মুজিবের নিজের দল।
এর ফলে দেশে স্থিতিশীলতা আসতে শুরু করে। সমস্ত দেশ যখন ক্ষয়ক্ষতি কাটিয়ে উঠে ঘুরে দাঁড়াচ্ছিল, ঠিখ তখনই আসে আরেকটি আঘাত।

১৯৭৫ সালের ১৫ আগস্ট মধ্যরাতে একদল বিপথগামী সেনা কর্মকর্তা হত্যা করে শেখ মুজিব এবং তাঁর পরিবারের সদস্যদের। কেবল তাঁর দুই মেয়ে শেখ হাসিনা ও শেখ রেহানা সেই সময় দেশের বাইরে থাকায় বেঁচে যান। সদ্য স্বাধীন জাতির জীবনে এক অপূরণীয় ক্ষতি নিয়ে আসে এই জঘন্য হত্যাকাণ্ড, তৈরি করে রাজনৈতিক শূণ্যতা, ব্যাহত হয় গণতান্ত্রিক উন্নয়নের ধারা।''',
                          style: TextStyle(fontSize: 20),
                          textAlign: TextAlign.center,
                        ),
                      ),
                    )
                  ],
                ),
              ),
            ),
          ),
        ),
      )),
    );
  }
}
